Tekla Open API Reference for Tekla Structures 2025
OBB Properties
The OBB type exposes the following members.
Properties
Name | Description
Axis0
 Gets an axis parallel to one side of the OBB, a unit-length vector orthogonal to Axis1 and Axis2.
Axis1
 Gets an axis parallel to the second side of the OBB, a unit-length vector orthogonal to Axis0 and Axis2.
Axis2
 Gets an axis parallel to the third side of the OBB, a unit-length vector orthogonal to Axis0 and Axis1.
Center
 Gets or sets the center point of the box.
Extent0
 Gets or sets the extent parallel to Axis0.
Extent1
 Gets or sets the extent parallel to Axis1.
Extent2
 Gets or sets the extent parallel to Axis2.
Top
See Also
Reference
OBB Class
Tekla.Structures.Geometry3d Namespace